In [11]:
import pandas as pd
import numpy as np

In [127]:
# Table 1 (Project Dataframe)
Project = {
    'ID': ['A001','A002','A003','A004','A005','A002','A005','A003','A001','A003','A001','A004','A004','A005'],
    'Project': ['Project1', 'Project2','Project3', 'Project4','Project5', 'Project6','Project7','Project8', 'Project9','Project10','Project11','Project12','Project13','Project14'],
    'Cost': [1002000,2000000,4500000,5500000,None,680000,400000,350000,None,300000,2000000,1000000,3000000,200000],
    'Status': ['Finished','Ongoing','Finished','Ongoing','Finished','Failed','Finished','Failed','Ongoing','Finished','Failed','Ongoing','Finished','Finished']
}
df1 = pd.DataFrame(Project)

In [129]:
df1.to_csv('project_data.csv', index=False)

In [131]:
print(df1)

      ID    Project      Cost    Status
0   A001   Project1 1002000.0  Finished
1   A002   Project2 2000000.0   Ongoing
2   A003   Project3 4500000.0  Finished
3   A004   Project4 5500000.0   Ongoing
4   A005   Project5       NaN  Finished
5   A002   Project6  680000.0    Failed
6   A005   Project7  400000.0  Finished
7   A003   Project8  350000.0    Failed
8   A001   Project9       NaN   Ongoing
9   A003  Project10  300000.0  Finished
10  A001  Project11 2000000.0    Failed
11  A004  Project12 1000000.0   Ongoing
12  A004  Project13 3000000.0  Finished
13  A005  Project14  200000.0  Finished

In [133]:
# Table 2 (EMployee Datarame)
Employee = {
    'ID': ['A001','A002','A003','A004','A005'],
    'Name': ['John Alter','Alice Luxumberg','Tom Sabestine','Nina Adgra','Amy Johny'],
    'Gender': ['M','F','M','F','F'],
    'City': ['Paris','London','Berlin','Newyork','Madrid'],
    'Age': [25,7,29,31,30]
}
df2 = pd.DataFrame(Employee)

In [135]:
df2.to_csv('project_data.csv', index=False)

In [137]:
print(df2)

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London    7
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [139]:
# Table 3 (Seniority level Dataframe)
Seniority_Level = {
    'ID': ['A001','A002','A003','A004','A005'],
    'Designation Level': [2,2,3,2,3]
}
df3 = pd.DataFrame(Seniority_Level)

In [141]:
df3.to_csv('project_data.csv', index=False)

In [143]:
print(df3)

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [145]:
import numpy as np

In [149]:
#compute these missing values in cost column by running average
running_sum = 0
count = 0

for i in range(len(df1)):
    if pd.isna(df1.loc[i, 'Cost']): 
        if count > 0:
            df1.loc[i, 'Cost'] = running_sum / count 
    else:
        running_sum += df1.loc[i, 'Cost']
        count = count + 1

pd.set_option('display.float_format', '{:.1f}'.format)
print(df1)

      ID    Project      Cost    Status
0   A001   Project1 1002000.0  Finished
1   A002   Project2 2000000.0   Ongoing
2   A003   Project3 4500000.0  Finished
3   A004   Project4 5500000.0   Ongoing
4   A005   Project5 3250500.0  Finished
5   A002   Project6  680000.0    Failed
6   A005   Project7  400000.0  Finished
7   A003   Project8  350000.0    Failed
8   A001   Project9 2061714.3   Ongoing
9   A003  Project10  300000.0  Finished
10  A001  Project11 2000000.0    Failed
11  A004  Project12 1000000.0   Ongoing
12  A004  Project13 3000000.0  Finished
13  A005  Project14  200000.0  Finished

In [151]:
print(df2)

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London    7
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [155]:
#Split the name column in the Employee dataframe 
df2[['First Name', 'Last Name']] = df2['Name'].str.split(' ', expand=True)

In [157]:
#remove the older “name” column.
df2 = df2.drop(columns=['Name'])

In [159]:
print(df2)

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London    7      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [161]:
#Join all three dataframes in one single dataframe “Final”

Final = pd.merge(df1, df2, on='ID').merge(df3, on='ID')

In [163]:
print(Final)

      ID    Project      Cost    Status Gender     City  Age First Name  \
0   A001   Project1 1002000.0  Finished      M    Paris   25       John
1   A002   Project2 2000000.0   Ongoing      F   London    7      Alice
2   A003   Project3 4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project4 5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project5 3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project6  680000.0    Failed      F   London    7      Alice
6   A005   Project7  400000.0  Finished      F   Madrid   30        Amy
7   A003   Project8  350000.0    Failed      M   Berlin   29        Tom
8   A001   Project9 2061714.3   Ongoing      M    Paris   25       John
9   A003  Project10  300000.0  Finished      M   Berlin   29        Tom
10  A001  Project11 2000000.0    Failed      M    Paris   25       John
11  A004  Project12 1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project13 3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project14  200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level
0       Alter                  2
1   Luxumberg                  2
2   Sabestine                  3
3       Adgra                  2
4       Johny                  3
5   Luxumberg                  2
6       Johny                  3
7   Sabestine                  3
8       Alter                  2
9   Sabestine                  3
10      Alter                  2
11      Adgra                  2
12      Adgra                  2
13      Johny                  3

In [165]:
#Add a new bonus column in the Final dataframe for finished project
Final['bonus'] = Final.apply(
    lambda row: row['Cost'] * 0.05 if row['Status'] == 'Finished' else 0,
    axis=1
)

In [167]:
print(Final)

      ID    Project      Cost    Status Gender     City  Age First Name  \
0   A001   Project1 1002000.0  Finished      M    Paris   25       John
1   A002   Project2 2000000.0   Ongoing      F   London    7      Alice
2   A003   Project3 4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project4 5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project5 3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project6  680000.0    Failed      F   London    7      Alice
6   A005   Project7  400000.0  Finished      F   Madrid   30        Amy
7   A003   Project8  350000.0    Failed      M   Berlin   29        Tom
8   A001   Project9 2061714.3   Ongoing      M    Paris   25       John
9   A003  Project10  300000.0  Finished      M   Berlin   29        Tom
10  A001  Project11 2000000.0    Failed      M    Paris   25       John
11  A004  Project12 1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project13 3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project14  200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level    bonus
0       Alter                  2  50100.0
1   Luxumberg                  2      0.0
2   Sabestine                  3 225000.0
3       Adgra                  2      0.0
4       Johny                  3 162525.0
5   Luxumberg                  2      0.0
6       Johny                  3  20000.0
7   Sabestine                  3      0.0
8       Alter                  2      0.0
9   Sabestine                  3  15000.0
10      Alter                  2      0.0
11      Adgra                  2      0.0
12      Adgra                  2 150000.0
13      Johny                  3  10000.0

In [177]:
#Demote the designation level by 1, whose projects have status “failed"

Final['Designation Level'] = Final.apply(
    lambda row: row['Designation Level'] - 1 if row['Status'] == 'Failed' else row['Designation Level'],
    axis=1
)

In [179]:
#Delete the employees record whose designation level is above 4.
Final = Final[Final['Designation Level'] <= 4]

In [181]:
print(Final)

      ID    Project      Cost    Status Gender     City  Age First Name  \
0   A001   Project1 1002000.0  Finished      M    Paris   25       John
1   A002   Project2 2000000.0   Ongoing      F   London    7      Alice
2   A003   Project3 4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project4 5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project5 3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project6  680000.0    Failed      F   London    7      Alice
6   A005   Project7  400000.0  Finished      F   Madrid   30        Amy
7   A003   Project8  350000.0    Failed      M   Berlin   29        Tom
8   A001   Project9 2061714.3   Ongoing      M    Paris   25       John
9   A003  Project10  300000.0  Finished      M   Berlin   29        Tom
10  A001  Project11 2000000.0    Failed      M    Paris   25       John
11  A004  Project12 1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project13 3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project14  200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level    bonus
0       Alter                  2  50100.0
1   Luxumberg                  2      0.0
2   Sabestine                  3 225000.0
3       Adgra                  2      0.0
4       Johny                  3 162525.0
5   Luxumberg                  0      0.0
6       Johny                  3  20000.0
7   Sabestine                  1      0.0
8       Alter                  2      0.0
9   Sabestine                  3  15000.0
10      Alter                  0      0.0
11      Adgra                  2      0.0
12      Adgra                  2 150000.0
13      Johny                  3  10000.0

In [183]:
#Add “Mr.” and “Mrs.” to the first name column 

Final['First Name'] = Final.apply(
    lambda row: 'Mr. ' + row['First Name'] if row['Gender'] == 'M' else 'Mrs. ' + row['First Name'],
    axis=1
)

In [185]:
print(Final)

      ID    Project      Cost    Status Gender     City  Age  First Name  \
0   A001   Project1 1002000.0  Finished      M    Paris   25    Mr. John
1   A002   Project2 2000000.0   Ongoing      F   London    7  Mrs. Alice
2   A003   Project3 4500000.0  Finished      M   Berlin   29     Mr. Tom
3   A004   Project4 5500000.0   Ongoing      F  Newyork   31   Mrs. Nina
4   A005   Project5 3250500.0  Finished      F   Madrid   30    Mrs. Amy
5   A002   Project6  680000.0    Failed      F   London    7  Mrs. Alice
6   A005   Project7  400000.0  Finished      F   Madrid   30    Mrs. Amy
7   A003   Project8  350000.0    Failed      M   Berlin   29     Mr. Tom
8   A001   Project9 2061714.3   Ongoing      M    Paris   25    Mr. John
9   A003  Project10  300000.0  Finished      M   Berlin   29     Mr. Tom
10  A001  Project11 2000000.0    Failed      M    Paris   25    Mr. John
11  A004  Project12 1000000.0   Ongoing      F  Newyork   31   Mrs. Nina
12  A004  Project13 3000000.0  Finished      F  Newyork   31   Mrs. Nina
13  A005  Project14  200000.0  Finished      F   Madrid   30    Mrs. Amy

    Last Name  Designation Level    bonus
0       Alter                  2  50100.0
1   Luxumberg                  2      0.0
2   Sabestine                  3 225000.0
3       Adgra                  2      0.0
4       Johny                  3 162525.0
5   Luxumberg                  0      0.0
6       Johny                  3  20000.0
7   Sabestine                  1      0.0
8       Alter                  2      0.0
9   Sabestine                  3  15000.0
10      Alter                  0      0.0
11      Adgra                  2      0.0
12      Adgra                  2 150000.0
13      Johny                  3  10000.0

In [187]:
# drop the gender column.
Final = Final.drop(columns=['Gender'])

In [189]:
print(Final)

      ID    Project      Cost    Status     City  Age  First Name  Last Name  \
0   A001   Project1 1002000.0  Finished    Paris   25    Mr. John      Alter
1   A002   Project2 2000000.0   Ongoing   London    7  Mrs. Alice  Luxumberg
2   A003   Project3 4500000.0  Finished   Berlin   29     Mr. Tom  Sabestine
3   A004   Project4 5500000.0   Ongoing  Newyork   31   Mrs. Nina      Adgra
4   A005   Project5 3250500.0  Finished   Madrid   30    Mrs. Amy      Johny
5   A002   Project6  680000.0    Failed   London    7  Mrs. Alice  Luxumberg
6   A005   Project7  400000.0  Finished   Madrid   30    Mrs. Amy      Johny
7   A003   Project8  350000.0    Failed   Berlin   29     Mr. Tom  Sabestine
8   A001   Project9 2061714.3   Ongoing    Paris   25    Mr. John      Alter
9   A003  Project10  300000.0  Finished   Berlin   29     Mr. Tom  Sabestine
10  A001  Project11 2000000.0    Failed    Paris   25    Mr. John      Alter
11  A004  Project12 1000000.0   Ongoing  Newyork   31   Mrs. Nina      Adgra
12  A004  Project13 3000000.0  Finished  Newyork   31   Mrs. Nina      Adgra
13  A005  Project14  200000.0  Finished   Madrid   30    Mrs. Amy      Johny

    Designation Level    bonus
0                   2  50100.0
1                   2      0.0
2                   3 225000.0
3                   2      0.0
4                   3 162525.0
5                   0      0.0
6                   3  20000.0
7                   1      0.0
8                   2      0.0
9                   3  15000.0
10                  0      0.0
11                  2      0.0
12                  2 150000.0
13                  3  10000.0

In [191]:
# Promote designation level by 1 for the employees whose age is more than 29 years
Final['Designation Level'] = Final.apply(
    lambda row: row['Designation Level'] + 1 if row['Age'] >= 29 else row['Designation Level'],
    axis=1
)

In [193]:
print(Final)

      ID    Project      Cost    Status     City  Age  First Name  Last Name  \
0   A001   Project1 1002000.0  Finished    Paris   25    Mr. John      Alter
1   A002   Project2 2000000.0   Ongoing   London    7  Mrs. Alice  Luxumberg
2   A003   Project3 4500000.0  Finished   Berlin   29     Mr. Tom  Sabestine
3   A004   Project4 5500000.0   Ongoing  Newyork   31   Mrs. Nina      Adgra
4   A005   Project5 3250500.0  Finished   Madrid   30    Mrs. Amy      Johny
5   A002   Project6  680000.0    Failed   London    7  Mrs. Alice  Luxumberg
6   A005   Project7  400000.0  Finished   Madrid   30    Mrs. Amy      Johny
7   A003   Project8  350000.0    Failed   Berlin   29     Mr. Tom  Sabestine
8   A001   Project9 2061714.3   Ongoing    Paris   25    Mr. John      Alter
9   A003  Project10  300000.0  Finished   Berlin   29     Mr. Tom  Sabestine
10  A001  Project11 2000000.0    Failed    Paris   25    Mr. John      Alter
11  A004  Project12 1000000.0   Ongoing  Newyork   31   Mrs. Nina      Adgra
12  A004  Project13 3000000.0  Finished  Newyork   31   Mrs. Nina      Adgra
13  A005  Project14  200000.0  Finished   Madrid   30    Mrs. Amy      Johny

    Designation Level    bonus
0                   2  50100.0
1                   2      0.0
2                   4 225000.0
3                   3      0.0
4                   4 162525.0
5                   0      0.0
6                   4  20000.0
7                   2      0.0
8                   2      0.0
9                   4  15000.0
10                  0      0.0
11                  3      0.0
12                  3 150000.0
13                  4  10000.0

In [195]:
#cost of all projects for each Employee 
TotalProjCost = Final.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()
TotalProjCost.rename(columns={'Cost': 'Total cost'}, inplace=True)

In [197]:
print(TotalProjCost)

     ID  First Name  Total cost
0  A001    Mr. John   5063714.3
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

In [203]:
#all the employee details whose city name contains the letter “o” in it.
filtered_employees = Final[Final['City'].str.contains('o', case=False)]

In [205]:
print(filtered_employees)

      ID    Project      Cost    Status     City  Age  First Name  Last Name  \
1   A002   Project2 2000000.0   Ongoing   London    7  Mrs. Alice  Luxumberg
3   A004   Project4 5500000.0   Ongoing  Newyork   31   Mrs. Nina      Adgra
5   A002   Project6  680000.0    Failed   London    7  Mrs. Alice  Luxumberg
11  A004  Project12 1000000.0   Ongoing  Newyork   31   Mrs. Nina      Adgra
12  A004  Project13 3000000.0  Finished  Newyork   31   Mrs. Nina      Adgra

    Designation Level    bonus
1                   2      0.0
3                   3      0.0
5                   0      0.0
11                  3      0.0
12                  3 150000.0